'''
step01_array 관련 문제 
 문제) 정규분포를 따르는 난수를 이용하여 5행 4열 구조의 다차원 배열 객체를 생성하고,
       각 행 단위로 합계, 최댓값, 최솟값을 구하시오.

'''    

import numpy as np

arr_rd = np.random.randn(5,4)
arr_rd
'''
array([[-0.5639343 ,  0.25659271,  0.49377324,  0.04205396],
       [ 0.87647248, -0.17110721, -1.20473895, -1.30365697],
       [-1.12853619,  0.4925992 , -0.10562666,  0.39182972],
       [ 1.36905686, -1.57945369, -0.27700662,  1.73526903],
       [ 2.41668487, -0.33698805,  0.59715255, -0.29371126]])
'''


print('1행 합계 : ', arr_rd[0,:].sum())
print('1행 최댓값 : ', arr_rd[0,:].max())
print('1행 최솟값 : ', arr_rd[0,:].min())

print('2행 합계 : ', arr_rd[1,:].sum())
print('2행 최댓값 : ', arr_rd[1,:].max())
print('2행 최솟값 : ', arr_rd[1,:].min())

print('3행 합계 : ', arr_rd[2,:].sum())
print('3행 최댓값 : ', arr_rd[2,:].max())
print('3행 최솟값 : ', arr_rd[2,:].min())

print('4행 합계 : ', arr_rd[3,:].sum())
print('4행 최댓값 : ', arr_rd[3,:].max())
print('4행 최솟값 : ', arr_rd[3,:].min())

print('5행 합계 : ', arr_rd[4,:].sum())
print('5행 최댓값 : ', arr_rd[4,:].max())
print('5행 최솟값 : ', arr_rd[4,:].min())
